## Pandas-
#### Two primary data structures- Series and DataFrame
#### A Series is a one-dimensional array-like object, 
#### while a DataFrame is a two-dimensional, size-mutable, and potentially heterogeneous tabular data structure with labeled axes (rows and columns).

In [4]:
#Series
##A Pandas Series is a one-dimensional array-like object that can hold any data type. It is similar to a column in a table.
#create series form list
import pandas as pd
data =[1,2,3,4,5]
series=pd.Series(data)
print(f"series: \n{series}")

series:
0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
#create series from dictionary
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [6]:
data=[1,2,3]
index=['a','b','c']
pd.Series(data,index=index)

a    1
b    2
c    3
dtype: int64

In [16]:
#DataFrame
#create a df from a dictionary of list

data={
    'Name':['krish','john','jack'],
    'age':[25,30,45],
    'city':['bangalore','new york','florida']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  age       city
0  krish   25  bangalore
1   john   30   new york
2   jack   45    florida
<class 'pandas.core.frame.DataFrame'>

In [9]:
#can also print df using numpy
import numpy as np
np.array(df)

array([['krish', 25, 'bangalore'],
       ['john', 30, 'new york'],
       ['jack', 45, 'florida']], dtype=object)

In [58]:
#create a data fram from a list of dictionaries

data=[
    {'Name':'krish','age':25,'city':'bangalore'},
    {'Name':'john','age':20,'city':'mumbai'},
    {'Name':'rush','age':22,'city':'new york'}
]

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  age       city
0  krish   25  bangalore
1   john   20     mumbai
2   rush   22   new york
<class 'pandas.core.frame.DataFrame'>

In [82]:
df=pd.read_csv("sales_data.csv")
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [15]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [18]:
#accessing data from dataframe

df

    Name  age       city
0  krish   25  bangalore
1   john   30   new york
2   jack   45    florida

In [56]:
df['Name'] #printing values of a col

0    krish
1     john
2     rush
Name: Name, dtype: object

In [25]:
#iloc and loc
data={'age':[22,33,11,23],'year':[2002,2003,1999,1998]}
df=pd.DataFrame(data,index=['rush','qwerty','asdfg','vrushali'])

print(df)

          age  year
rush       22  2002
qwerty     33  2003
asdfg      11  1999
vrushali   23  1998

In [35]:
print(df.loc['rush'])
print(df.loc[['rush','vrushali'],'age'])
print(df.loc['rush':'vrushali','age'])

age       22
year    2002
Name: rush, dtype: int64
rush        22
vrushali    23
Name: age, dtype: int64
rush        22
qwerty      33
asdfg       11
vrushali    23
Name: age, dtype: int64

In [36]:
data={'age':[22,33,11,23],'year':[2002,2003,1999,1998]}
df=pd.DataFrame(data,index=['rush','qwerty','asdfg','vrushali'])

print(df)

          age  year
rush       22  2002
qwerty     33  2003
asdfg      11  1999
vrushali   23  1998

In [49]:
print(df.iloc[[0,2],1]) #rush age year

rush     2002
asdfg    1999
Name: year, dtype: int64

In [48]:
print(df.iloc[0:3,0])

rush      22
qwerty    33
asdfg     11
Name: age, dtype: int64

In [62]:

data=[
    {'Name':'krish','age':25,'city':'bangalore'},
    {'Name':'john','age':20,'city':'mumbai'},
    {'Name':'rush','age':22,'city':'new york'}
]

df=pd.DataFrame(data)
df

    Name  age       city
0  krish   25  bangalore
1   john   20     mumbai
2   rush   22   new york

In [64]:
##accessing a specified element using at

print(df.at[1,'age'])
print(df.at[2,'city'])

20
new york

In [66]:
##accessing a specified element using iat
df.iat[0,2]

'bangalore'

In [67]:
##data manioulation with dataframe
df

    Name  age       city
0  krish   25  bangalore
1   john   20     mumbai
2   rush   22   new york

In [68]:
#adding new column salary
df['salary']=[50000,60000,80000]

In [69]:
df

    Name  age       city  salary
0  krish   25  bangalore   50000
1   john   20     mumbai   60000
2   rush   22   new york   80000

In [72]:
#remove a column
df.drop('salary',axis=1) #axis=0 checks for value in row , axis=1 checks for value in col

    Name  age       city
0  krish   25  bangalore
1   john   20     mumbai
2   rush   22   new york

In [75]:
#salary doesnt get removed permanently, we use inplace to save
df.drop('salary',axis=1,inplace=True)

In [76]:
df

    Name  age       city
0  krish   25  bangalore
1   john   20     mumbai
2   rush   22   new york

In [78]:
#add age to the column

df['age']=df['age']+1

In [79]:
df

    Name  age       city
0  krish   26  bangalore
1   john   21     mumbai
2   rush   23   new york

In [80]:
df.drop(0,inplace=True)

In [81]:
df

   Name  age      city
1  john   21    mumbai
2  rush   23  new york

In [83]:
df=pd.read_csv("sales_data.csv")
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [84]:
df.dtypes

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [85]:
df.describe()

       Transaction ID  Units Sold   Unit Price  Total Revenue
count       240.00000  240.000000   240.000000     240.000000
mean      10120.50000    2.158333   236.395583     335.699375
std          69.42622    1.322454   429.446695     485.804469
min       10001.00000    1.000000     6.500000       6.500000
25%       10060.75000    1.000000    29.500000      62.965000
50%       10120.50000    2.000000    89.990000     179.970000
75%       10180.25000    3.000000   249.990000     399.225000
max       10240.00000   10.000000  3899.990000    3899.990000